package com.guntur.santripunya.model

data class Kitab(
    val id: Int,
    val title: String,
    val author: String,
    val content: String
)

val dummyKitab = listOf(
    Kitab(1,
        "Nadzhom Imrity", "Imrity",

                "104. وَلْيَقْتَرِنْ بِالْفَا جَوَابٌ لَوْ وَقَعْ*** بَعْدَ ْالاَدَاتِ مَوْضِعَ الشَّرْطِ اْمَتنَعْ"+
        "باب مرفوعات الاسماء\n" +
                "\n" +
                "105. مَرْفُوْعُ اْلاَسْمَا سَبْعَةٌ نَأْتِى بِهَا*** مَعْلُوْمَةَ اْلاَسْمَاءِ مِنْ تَبْوِيْبِهَا\n" +
                "\n" +
                "106. فَاْلفَاعِلُ اْسمٌ مُطْلَقًا قَدِ اْرتَفِعْ*** بِفِعْلِهِ وَاْلــــفِعْلُ قَبـْلَـهُ وَقَـــعْ\n" +
                "\n" +
                "107. وَوَاجِبٌ فِى اْلـفِعْلِ اَنْ يُجَرَّدَا*** اِذَالِــجَمْــعٍ اَوْ مُثَنىًّ أُسْنِدَا\n" +
                "\n" +
                "108. فَــقُلْ أَ تَـى الزَّيْدَانِ وَالزَّيْدُوْنَ*** كَـــجَاءَ زَيْدٌ وَ يَــجـِى اَخُوْناَ\n" +
                "\n" +
                "109. وَقَسَّمُوْهُ ظَاهِرًا اَوْمُضْــمَرًا*** فَالظَّاهِرُ اللَّفْظُ الَّذِى قَدْ ذُكِرَ\n" +
                "\n" +
                "110. وَاْلمُضْمَرُ اثْنَا عَشْرَ نَوْعًا قِسْمًا*** كَقُمْتُ قُمْنَا قُمْتَ قُمْتِ قُمْتُمَا\n" +
                "\n" +
                "111. قُمْتُنَّ قُمْتُمْ قَامَ قَامَتْ قَــامَا*** قَامُوا وَقُمْنَ نَحْوُ صُمْتُمْ عَامًا\n" +
                "\n" +
                "112. وَهَذِهِ ضَــــمَائــِرٌ مُـــــتَّصِلَةْ*** وَمِثْلُهَا الضَّــــــــمَائِرُ اْلمُنْفَصِلَةْ\n" +
                "\n" +
                "113. كَـــــــلَمْ يـَـــــقُمْ اِلاَّ اَنـَا وَاَنْتُمُ*** وَغَيْرُ ذَيْنِ بِاْلقِـــــــــيَاسِ يُعْــــلَمُ"+
        "باب نائب الفاعل\n" +
                "\n" +
                "114. أَقِمْ مَقَامَ اْلفَاعِلِ الَّذِى حُذِفْ *** مَفْعُوْلَهُ فِى كُلِّ مَا لَهُ عُرِفْ\n" +
                "\n" +
                "115. َاوْ مَصْدَرًا اَوْظَرْفًا اَوْ مَـجْرُوْرَا*** ِانْ لـَـمْ تَجِدْمَفْـــعُوْلَهُ اْلمَذْكُوْرَا\n" +
                "\n" +
                "116. وَاَوَّلُ اْلفِعْلِ الَّذِى هُنَا يُــــضَمْ*** وَكَـسْرُ مَا قَبْلَ اْلاَخِيْرِ مُلْتَزَم\n" +
                "\n" +
                "117. فِى كُلِّ مَاضٍى وَهْوَ فِى اْلمُضَارِعِ*** مُنْفَتِحٌ كَــــــــيُدَّعَى وَكَادُّعِى\n" +
                "\n" +
                "118. وَاَوَّلُ الْفِعْـــــــــلِ الَّذِى كَبَاعَ*** مُنْكَسِرٌ وَهُوَ اَّلذِى قَدْ شَاعَا\n" +
                "\n" +
                "119. وَذَاكَ اِمَّا مُضْمَرٌ اَوْ مُظْهَرَ*** ثَانِيْهِمَا كَــــــــــــيُكْرَمُ اْلـــــمُبَشِّرُ\n" +
                "\n" +
                "120. اَمَّا الضَّمِيْرُ فَهُوَ نَحْوُ قَوْلـِنَا *** دُعِيْتُ اُدْعَى مَا دُعِى اِلاَّ اَناَ"+
        "باب المبتدأ والخبر\n"
    ),
    Kitab(
        2,
        "Nadzhom Maqsud",
        "Maqsud",
        "بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ" +
                "\nيَقُوْلُ بَعْدَ حَـمْـدِ ذِي الجَـلاَلِ ** مُـصَـلِّـيًـا عَلَـى النَّـِبيْ وَ الآلِ"+
                "\nعَـبْـدٌ أَسِـيْـرُ رَحْمَةِ الـكَرِيمِ ** أَيْ أَحْـمَدُ بْنُ عَابِـدِ الـرَّحِيْــم"+
                "\nأبواب الفعل الثلاثي"+
                "\nفِعْلٌ ثـُلاَثِـيٌّ إِذَا يُجَــــرَّدُ ** أَبْوَابُـهُ سِـتٌّ كَمَا سَــتُسْــرَدُ"+
                "\nفَالعَيْنُ إِنْ تُفْـتَحْ بِمَاضٍ فَاكْسِـرِ ** أَوْ ضُمَّ أوْ فَافْـتَحْ لَـهَا فِي الغَـابِـرِ"+
                "\nوَإِنْ تُـضَمَّ فَاضْمُـمَنْـهَا فِـيْهِ ** أوْ تَـنْـكَسِرْ فَافْتَحْ وَكَسْرًا عِـيْـهِ"+
        "\nوَلاَمٌ اوْ عَيْنٌ بِـمَا قَـدْ فُـتِحَـا ** حَلْقِيْ سِوَى ذَا بِالشُّذُوذ ِ اتَّضَحَـا"+
        "\nفصل في أبواب الرباعي المجرد والملحق به"+
        "\nثُمَّ الــرُّبَاعِىُّ بِبَــابٍ وَاحِدِ ** وَ الْحِقْ بِـهِ سِتـًّا بِغَـيْرِ زَائِـدِ"+
        "\nفَـوْعَـلَ فَعْوَلَ كَذَاكَ فَـيْعَـلاَ ** فَعْـيَلَ فَـعْلَى وَ كَذَاكَ فَـعْـلَـلاَ"+
        "\nزَيْـدُ الثُّلاَثِيْ أَرْبَـعٌ مَعْ عَشْـرِ ** وَهْيَ لِأَقْسَـامٍ ثَـلاَثٍ تَـجْــرِي"+
        "\nفصل في أبواب الثلاثي المزيد"+
        "\nأَوَّلُـهَا الرُّبَـاعِ مِثْلُ أَكْرَمَــا ** وَفَعَّـلَ وَ فَـاعَلاَ كَـخَاصَمَـــا"+
        "\nوَاخْصُصْ خُمَاسِيًّا بِذِي الأَوْزَانِ ** فَـبَـدْؤُهَا كَـا نْكَـسَرَ وَ الثَّـانِي"+
        "\nاِفْـتَعَلَ اِفْـعَلَّ كَذَا تَفَــعَّلاَ ** نَــحْوُ تَعَــلَّمَ وَزِدْ تَفَاعَـــلاَ"+
        "\nثُمَّ السُّدَاسِيْ استَفْعَلاَ وَ افْعَوْعَـلاَ ** وَافْعَــوَّلَ افْعَـنْلَى يَـلِيهِ افْعَنْلَـلاَ"+
        "\nوَافْعَالَ مَا قَدْ صَاحَبَ الَّلاَمَينِ ** زَيْـدُ الرُّبَاعِـيِّ عَلَـى نَوْعَــيْنِ"+
        "\nذِي سِتَّةٍ نَحْوُ افْعَلَلَّ افْعَنْلَـلاَ ** ثُـمَّ الـخُـمَاسِيْ وَزْنُـهُ تَفَعْلَـلاَ"+
        "\nبَابُ الـمَصْدَرِ وَمَا يُشْتَقُّ مِنْهُ"+
        "\nوَ مَصْـدَر ٌ أَتَـى عَلَى ضَرْبَـيْنِ ** مِيْمِـي وَ غَـيْرِهِ عَلَـى قِـسْــمَيْنِ"+
        "\nمِنْ ذِي الثُّلاَثِ فَالزَمِ الَّذِي سُمِعْ *** وَمَا عَــدَاهُ فَـالقِــيَاسَ تَـتَّـبِعْ"+
        "\nمِيْمِي الثُّلَاثِي إِن يَّكُنْ مِنْ أَجْوَفِ ** صَحِيْـحٍ اوْ مَـهْـمُوزٍ اوْ مُضَـعَّفِ"+
        "\nأَتَى كَمَــفْعَلٍ بِفَـتْحَـتَـيْنِ ** وَشَـذَّ مِنْـهُ مَــا بِـكَـسْرِ الـعَيْنِ"+
        "\nكَذَا سِـمُ الزَّمَانِ وَ المَكَانِ مِنْ ** مُـضَـارِع ٍ إن لاَّ بِـكَسْـرِهَـا يَبِنْ"+
        "\nوَافْـتَحْ لَهَا مِن نَّاقِصٍ وَ مَا قُرِنْ ** وَ اعْـكِسْ بِمُعْـتَلٍّ كَـمَفْرُوْقٍ يَعِنْ"+
        "\nوَ مَا عَدَا الثُّلاَثِ كُلاًّ اجْـعَلاَ ** مِـثْلَ مُــضَارِعٍ لَـهَا قَــدْ جُهِلاَ"+
        "\nكَذَا اسْمُ مَفْعُوْلٍ وَ فَاعِلٍ كُسِرْ ** عَيْــنًا وَأَوَّلٌ لَـهَا مِيْــمًا يَـصِرْ"+
        "\nوَ آخِرَ المَاضِي افْـتَحَنْهُ مُـطْلَقَا ** وَضُـمَّ إِنْ بِــوَاوِ جَـمْعٍ أُلْحِــقَا"+
        "\nوَسَكِّنِ انْ ضَمِيْرَ رَفْعٍ حُرِّكَـا ** وَبَدْءُ مَــعْلُوْمٍ بِفَتْحٍ سُـلِكَـــا"+
        "\nإِلاَّ الـخُمَاسِيْ والسُّدَاسِيْ فاكْسِرَن ** إِنْ بُـدِئَا بِـهَمْزِ وَصْـلٍ كَـا مْتَحَنْ"+
        "\nثُـبُوْتُهَا ِفي الاِبْتِدَا قَدِ التُـــزِمْ ** كَـحَذْفِـهَا فِي دَرْجِـهَا مَعَ الكَلِـمْ"+
        "\nكَـهَمْزِ أَمْــرٍ لَهُـمَا وَ مَصْدَرِ ** وَ أَلْ وَ أَيْمُـنٍ وَ هَمْزِ كَـا جْهَــرِ"+
        "\nوَ ابْـنُمٍ ابْنٍ ابْــنَةٍ وَ اثْنَـيْنِ ** وَ امْــرِىءٍ امْــرَأَةٍ وَ اثْـنَتَـيْنِ"+
        "\nكَذَا اسْمٌ اسْتٌ فِي الجَمِيْعِ فَاكْسِرَنْ ** لَهَا سِــوَى فِي أَيْـمُنٍ أَلِ افْتَـحَنْ"+
        "\nوَ أَمْـرُ ذِي ثَلاَثَـةٍ نَحْـوُ اقْبُلاَ ** ضُـمَّ كَـمَا بِـمَاضِيَـيْنِ جُهِـلاَ"+
        "\nوَ بَـدْءُ مَجْـهُوْلٍ بِضَـمٍّ حُـتِمَا ** كَـكَسْرِ سَـابِـقِ الَّذِي قَدْ خَتَمَـا"+
        "\nمُـضَارِعًا سِمْ بِحُرُوْفِ نَـأْتِـي ** حَيْـثُ لِمَشْهُـوْرِ الـمَعَانِي تَـأْتِي"+
        "\nفَـإِنْ بِمَـعْلُـوْمٍ فَفَتْحُهَا وَجَبْ ** إلاَّ الـرُّبَاعِيْ غَـيْرُ ضَـمٍّ مُجْتَنَـبْ"+
        "\nوَ مَا قُبَيْلَ الآخِـرِ اكْسِرْ أَبَـدَا ** مِنَ الَّذِي عَلَــى ثَلاَثَــةٍ عَـدَا"+
        "\nفِيْـمَا عَدَا مَا جَاءَ مِنْ تَفَـعَّلاَ ** كَـالآتِيْ مِنْ تَفَاعَلَ اوْ تَفَعْــلَلاَ"+
        "\nوَإِنْ بِمَجْهُوْلٍ فَضَـمُّـهَا لَـزِمْ ** كَفَـتْحِ سَـابِقِ الَّذِي بِهِ اخْـتُتِـمْ"+
        "\nوَ آخِرٌ لَـهُ بِمُقْـتَضَى العَمَـلْ ** مِنْ رَّفْعٍ اوْ نَصْبٍ كَذَا جَزْمٌ حَصَـلْ" +
                "\nأَمْـرٌ وَنَهْـيٌ إِن بِهِ لاَمًا تَصِـلْ ** أَوْلاَ وَ سَكِّنْ إِنْ يَّـصِحَّ كَلْتَمِــل" +
                "\nوَالآخِرَ احْذِفْ إنْ يُّـعَلْ كَالـنُّوْنِ فِي ** أَمْـثِلَــةٍ وَنُـوْنُ نِسْوَةٍ تَفِــي"+
        "\nفصل في أبنية فعل الأمر الحاضر واسم الفاعل والمفعول و صيغة المبالغة" +
                "\nوَ بَدْأَهُ احْذِفْ يَكُ أَمْرَ حَاضِرِ ** وَ هَمْزًا انْ سُكِّـنَ تَـالٍ صَــيِّر" +
                "\nأَوْ أَبْـقِ إِنْ مُحَرَّكًا ثُمَّ التَزِمْ ** بِنَـاءَهُ مِثْلَ مُـضَارِعٍ جُـــزِمْ" +
                "\n" +
                "كَفَاعِلٍ جِيءْ بِاسْم ِ فَاعِلٍ كَمَا ** يُـجَاءُ مِنْ عَلِـمَ أَوْ مِنْ عَزَمَــا" +
                "\n" +
                "وَمَاضٍ انْ بِضَمِّ عَيْنٍ اسْتَقَرْ ** كَـضَخْمٍ اوْ ظَـرِيْفٍ إِلاَّ مَانَـدَرْ" +
                "\n" +
                "وَ إِنْ بِكَسْرٍ لاَزِمًا جَا كَالفَعِلْ ** وَ الأَفْعَلِ الفَعْلاَنِ وَ احْفَظْ مَا نُقِـلْ" +
                "\n" +
                "بِوَزْنِ مَفْـعُوْلٍ كَـذَا فَعِيْلُ ** جَـا اسْـمُ مَفْعُوْلٍ كَـذَا قَتِـيْلُ" +
                "\n" +
                "لِكَـثْرَةٍ فَعَّـالٌ اوْ فَعُـوْلُ ** فَعِـلٌ اوْ مِفْــعَالٌ اوْ فَعِـيْـلُ" +
                "\n" +
                "فَصْلٌ فِي تَصْرِيْفِ الصَّحِيْحِ" +
                "\n" +
                "وَ مَاض ٍ اوْ مُضَارِعٌ تَـصَرَّفَا ** لأَوْجُهٍ كَالأَمْرِ وَ النَّهِي اعْرِفَـا" +
                "\n" +
                "ثَلاَثَةٌ لِغَـائِبٍ كَـالْغَائِـبَهْ ** كَذَا مُخَـاطَبٌ وَ كَالـمُخَاطَـبَهْ" +
                "\n" +
                "وَ مُتَكَـلِّمٌ لَهُ اثْـنَانِ هُمَـا ** فِي غَيْرِ أَمْـر ٍ ثُمَّ نَهْيً عُـلِمَا" +
                "\n" +
                "لِعَشْرَةٍ يُصَرَّفُ اسْمُ الفَاعِلِ ** فَعَـلَةٍ وَ فَاعِلَـينِ فَـاعِــلِ" +
                "\n" +
                "وَ فَاعِـلِينَ فُعَّـلٍ فُـعَّالِ ** وَ فِيْهِمَا اضْـمُمْ فَا وَشُدَّ التَّالِي" +
                "\n" +
                "فَاعِـلَةٍ فَاعِلَـتَينِ فَـاعِـــلاَ ** تِ وَ فَوَاعِلَ كَمَـا قَـدْ نُــقِلاَ" +
                "\n" +
                "ثُمَّ اسْمُ مَفْـعُوْلٍ لِسَـبْعٍ يَـاتِي ** مَفْـعُولَـةٍ وَ ثَـنِّ مَفْـعُـوْلاَتِ" +
                "\n" +
                "كَذَاكَ مَفْـعُوْلٌ مُثَـنَّاهُ وَ مَفْــ ** ـعُوْلُوْنَ ثُمَّ جَمْعُ تَكْسِيرٍ يُضَـفْ" +
                "\n" +
                "وَنُوَنَ تَوْكِيدٍ بِالأَمْرِ وَ النَّهِىِ صِلْ ** وَذَاتَ خِفٍّ مَعْ سُكُوْنٍ لاَتَصِلْ" +
                "\n" +
                "فَصْلٌ فِي فَوَائِدَ" +
                "\n" +
                "بالهَمْزِ وَ التَّضْعِيْفِ عَـدِّ مَالَـزِمْ ** وَ حَرْفِ جَــرٍّ إِنْ ثُلاَثِـيـًّا وُسِمْ" +
                "\n" +
                "وَ غَيْـرُه عَـدِّ بِمَا تَـأَخَّـرَا ** وَ إِنْ حَذَفْـتَهَا فَـلاَزِمـًا يُــرَى" +
                "\n" +
                "لِصَادِرٍ مِنِ امْرَأَينِ فَاعَـــلاَ ** وَقَـلَّ كَالإِلَـهُ زَيْـدَاً قَـاتَــلاَ" +
                "\n" +
                "وَلَهُـمَا أَوْ زَائِـدٍ تَفَاعَــلاَ ** وَقَـدْ أَتَى لِـغَـيْرِ وَاقِـعٍ جَـلاَ" +
                "\n" +
                "وَ ابْـدِلْ لِتَاءِ الِافْتِعَالِ طَـاءً انْ ** فَـاءٌ مِنَ احْرُفٍ لإِطْـبَاقٍ تَـبِنْ" +
                "\n" +
                "كَمَا تَصِيْرُ دَاَلاً إِنْ زَايًا تَـكُنْ ** أَوْ ذَالاً اوْ دَالاً كَـالاِزْدِجَارِ صُـنْ" +
                "\n" +
                "وَ إِنْ تَكُنْ فَالاِفْتَعَالِ يًا سَـكَنْ ** أَوْ وَاوًا اوْ ثَا صَـيِّرَنْ تَا وَ ادْغِمَنْ" +
                "\n" +
                "وَ احْكُمْ بِزَيْدٍ مِنْ أُوَيْسًا هَلْ تَنَمْ ** فَوْقَ الثَّـلاَثِ إِنْ بِذِي المَرَامُ تَـمْ" +
                "\n" +
                "وَ غَالِبَ الـرُّبـَاعِ عَدِّ مَاعَدَا ** فَـعْـلَلَ فَاعْكِسنْ كَدَرْبَخَ اهْتَدَى" +
                "\n" +
                "كُل ُّ الخُمَاسِي لاَزِمٌ إِلاَّ افْـتَعَلْ ** تَـفَـعَّلَ اوْ تَـفَاعَلاَ قَدِ احْـتَمَلْ" +
                "\n" +
                "كَذَا السُّدَاسِي غَيْرَ بَابِ اسْتَفْعَلاَ ** وَاسْرَنْدَى وَ اغْرَنْدَى بِمَفْـعُوْلٍ صِلاَ" +
                "\n" +
                "لِهَمْزِ إِفْـعَالٍ مَعَانٍ سَـبْعَـةُ ** تَعْـدِيَـةٌ صَـيْرُوْرَةٌ وَ كَـثْـرَةُ" +
                "\n" +
                "حَيْـنُونَـةٌ إِزَالَـةٌ وِجْـدَانُ ** كَـذَاكَ تَـعْرِيضٌ فَـذَا البَـيَانُ" +
                "\n" +
                "لِسِينِ الِاسْـتِفْعَالِ جَا مَـعَانِي ** لِـطَـلَبٍ صَـيْرُورَةٍ وِجْــدَانِ" +
                "\n" +
                "كَذَا اعْتِـقَادٌ بَعْدَهُ التَّـسْلِيْمُ ** سُـؤَالُـهُمْ كَـاسْـتَخْـيَرَ الكَرِيمُ"+
        "فَصْلٌ فِى حُرُوْفِ اْلعِّلَةِ وَاَحْكَامِهَا" +
                "\n" +
                "حُرُوْفُ وَاي هِيَ حُرُوفُ العِلَّةِ ** والمَـدِّ ثُمَّ اللِـيْنِ وَ الــزِّيَـادَةِ" +
                "\n" +
                "فَإن يَّكُن بِبَعْضِهَا المَاضِي افْتَتَحْ ** فَسَمِّ مُـعْـتَلاًّ مِـثَالاً كَوَضَـحْ" +
                "\n" +
                "وَنَاقِصَاً قُلْ كَـغَزَا إِنِ اخْتُـتِمْ ** بِـهِ وَ إِنْ بِجَوْفِـه ِ اجْـوَفَا عُـلِمْ" +
                "\n" +
                "وَبِلَفِيْفٍ ذِي اقْـتِرَانٍ سَمِّ إِنْ ** عَـيْنٌ لَهُ مِنْهَا كَـلاَمٍ تَسْـتَـبِنْ" +
                "\n" +
                "وَإِنْ تَـكُنْ فَـاء ٌ لَهُ وَ لاَمُ ** فَـذُو افْـتِـرَاقٍ كَـوَفَى الغُلاَمُ" +
                "\n" +
                "وَادْغِمْ لِمِثْلَي نَحْوُ يَازَيْدُ اكْفُفَا ** فَكُفَّ قُـلْ وَسَمِّهِ المُـضَـاعَـفَا" +
                "\n" +
                "مَهْمُوزٌ الَّذِي عَلَى الهَمْزِ اشْتَمَلْ ** نَحْـوُ قَـرَا سَـأَلَ قَـبْلَ مَاأَفَـلْ" +
                "\n" +
                "ثُمَّ الصَّحِيْحُ مَا عَدَا الَّذِي ذُكِرْ ** كَـا غْفِـرْ لَـنَا رَبِّي كَمَنَ لَهُ غُفِرْ" +
                "\n" +
                "بَابُ المُعْتَلاَّتِ وَالمُضَاعَفِ وَالمَهْمُوْزِ" +
                "\n" +
                "وَاوًا اوْ يـًا حُرِّكَا اقْـلِبْ أَلِفَا ** مِن بَـعْـدِ فَتْحٍ كَـغَزَا الَّذِيْ كَفَى" +
                "\n" +
                "ثُمَّ غَـزَوْا وَغَـزَتَا كَـذَا غَزَتْ ** وَ أَلِفٌ للسَّـاكِـنَـيْنِ حُـذِفَتْ" +
                "\n" +
                "وَالقَلْبُ فِي جَمْعِ الإِنَاثِ مُنْتَفِي ** وَغَزَوَا كَذَا غَزَوْتُ فَـاقْـتَـفِي" +
                "\n" +
                "وَانْسُبْ ِلأَجْوَفَ كَـقَالَ كَالَ مَا ** لِكَـغَـزَا ثُمَّ كَـفَى قَـدِ انْـتَمَى" +
                "\n" +
                "كَغَـزَتِ احْذِفْ أَلِفًا مِنْ قُلْنَ أَوْ ** كِلْنَ بِضَـمِّ فَـا وَ كَـسْرِها رَوَوْا" +
                "\n" +
                "وَالـيَاءُ إِنْ مَاقَـبْلَهَا قَـدِ انْكَسَرْ ** فَـابْقِ مِثَالُهُ خَشِـيْتَ لِلـضَّـرَرْ" +
                "\n" +
                "أَوْ ضُـمَّ مَعْ سُكُـوْنِهَا فَصَـيِّرِ ** وَاوًا فَقُلْ يُـوْسِرُ فِي كـيُـيْـسِرِ" +
                "\n" +
                "وَ وَاوٌ اثْرَ كَسْرٍ إِنْ تَسْكُنْ تَصِرْ ** يَاءً كَـجِـيْرَ بَعْدَ نَـقْـلٍ في جُوِرْ" +
                "\n" +
                "وَ إِنْ تُحَـرَّكْ وَهْيَ لاَمُ كِـلْمَةِ ** كَـذَا فَـقُلْ غَـبِيْ مِنَ الغَـبَاوَةِ" +
                "\n" +
                "حَرَكَـةٌ لِـيَا كَـوَاوٍ إِنْ عَقِبْ ** مَا صَـحَّ سَاكِـنًا فَـنَقْـلُهَا يَجِبْ" +
                "\n" +
                "مِثَالُ ذَا يَـقُوْلُ أَوْ يَـكِيْلُ ثُمْ ** يَـخَافُ وَ الأَلِـفُ عَن وَّاوٍ تـَقُمْ" +
                "\n" +
                "وَ إِنْ هُمَا مُحَـرَّكَيْنِ فِي طَرَفْ ** مُـضَارِعٍ لَـمْ يَنْتَصِبْ سَكِّنْ تُحَفْ" +
                "\n" +
                "نَحْوُ الَّذِي جَا مِن رَّمَى أَوْ مِنْ عَفَا ** أَوْ مِنْ خَـشِـيْ وَيَـاءَ ذَا اقْلِبْ أَلِفَا" +
                "\n" +
                "وَ احْذِفْـهُمَا فِي جَمْعِهِ لاَ التَّثْنِيَهْ ** وَ مَا كَـتَـغْزِيْنَ بِذَا مُسْـتَوِيَـهْ"+
                "\n" +
                "وَفِي اسْمِ فَاعِلِ اجْوَفٍ قُلْ قَائِلاَ ** بِـأَلِفِ زَيْـدٍ وَ هَمْزِ مَـا تَـلاَ" +
                "\n" +
                "فِي نَاقِصٍ قُلْ غَازٍ إِن لَّمْ يَنْتَصِبْ ** وَلاَ بِـأَلْ وَحَـذْفِ يَائِـهِ يَـجِبْ" +
                "\n" +
                "وَ كَـمَقُوْلٍ اسْمَ مَفْـعُوْل ٍ خُذَا ** بِالـنَّـقْلِ كَالمَـكِيْلِ وَاكْسِرْ فَاءَ ذَا" +
                "\n" +
                "وَمِثْـلَيِ المَغْـزُّوِ حَـتْمَا ً أَدْغِمَا ** كَـذَاكَ مَخْـشِـيْ بَعْدَ قَلْبٍ قُدِّمَا" +
                "\n" +
                "وَ أَمْـرُ غَائِبٍ أَتَى مِنْ أَجْوَفِ ** كَـلِـيَقُلْ وَ أَصْـلُـهُ غَيْرُ خَـفِيْ" +
                "\n" +
                "مُـخَاطَبٌ مِنْهُ كَقُلْ بِالـنَّقْلِ ** وَحَـذْفِ هَـمْزِهِ وَ عَيْنِ الأَصْـلِ" +
                "\n" +
                "وَثَـنِّـهِ عَلَى كَقُوْلاَ وَ التَـزِمْ ** مِن نَّـاقِصٍ فِي ذَيْـنِ حَذْفـًا لِلمُتِمْ" +
                "\n" +
                "وَحَذْفُ فَـا المُعْتَّلِ فِيْ مُسْتَقْبَلِ ** وَامْـرٍ وَنَـهْيٍ مَـتَى تُـعْلَمْ جَـلِي" +
                "\n" +
                "بِبَابِ مَـا كَوَهَبَ اوْ كَوَعَدَا ** وَرِثَ زِدْ و َقَــلَّ مَـا قَـدْ وَرَدَا" +
                "\n" +
                "ثُمَّ اللَّـفِيْفُ لاَ بِقَيدٍ قَدْ حُكِمْ ** لِـلاَمِـهِ بِـمَا لِـنَاقِــصٍ عُلِـمْ" +
                "\n" +
                "وَكَالصَّحِيْحِ احْكُمْ لِعَيْنِ مَاقُرِنْ ** وَفَاءِ مَـفْـرُوْقٍ كَـمُـعْـتَّلٍ زُكِنْ" +
                "\n" +
                "وَأَمْـرُ ذَا لِلْفَرْدِ قِهْ وَقِي قِـيَا ** لاِثْـنَـينِ قُـوْا وَ قِـيْنَ لِلْجَمْعِ ائْتِيَا" +
                "\n" +
                "وَمَا كَـمَـدٍّ مَصْدَرًا أَوْ مَـدَّ مِنْ ** مُـضَـاعَفٍ فَـهْـوَ بِإِدْغَامٍ قَمِنْ" +
                "\n" +
                "أَوْ كَمَـدَدْنَ أَوْ مَـدَدْنَا فَاظْـهِـرِ ** وَفِي كَلَمْ يَمُـدَّ جَوِّزْ كَــافْرِرِ" +
                "\n" +
                "مَهْـمُوْزٌ ابْدِلْ هَمْزَهُ مَتَى سَـكَنْ ** بِمُقْـتَـضَى حَرَكَـةٍ أَوِ اتْـرُكَنْ" +
                "\n" +
                "كَيَاكُلُ ايِذَنْ يُومِـنُوا و اتْرُكْ مَتَى ** حَـرَّكْـتَهُ وَ سَابِقٌ كَذَا أَتَــى" +
                "\n" +
                "نَحْـوُ قَرَا وَ إِن يُّـحَرَّكْ هُوْ فَقَطْ ** كَاسْأَلْ كَذَا وَسَلْ أَجِزْ كَمَا انْضَبَطْ" +
                "\n" +
                "وَحَذْفُ هَمْزِ خُذْ وَ مُرْ كُل لاَّ تَقِسْ ** وَ كَالصَّحِيْحِ غَيْرَهُ صَـرِّفْ وَ قِسْ" +
                "\n" +
                " قَد تَّـمَّ مَا رُمْـنَا مِنَ المقْصُـوْدِ ** فَاعْـذِرْ حَدِيْثَ السِّـنِّ يَاذَا الجُوْدِ" +
                "\n" +
                "وَ أَحْمَدُ الله َ مُــصَلِّـيـًا عَلَى ** مُـحَـمَّدٍ وَآلِــهِ وَمَنْ تَــلاَ"
    )
)